# Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача — вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)
# про слоавари в виде начиная с 47:23

# Создаем два словаря 1. Дни и 2. Месяцы

data = input('Введите дату в формате dd.mm.yyyy: ')
key_day = data[:2]
key_month = data[3:5]
year = data [6:]
days={
    '01':'первое',
    '02':'второе',
    '03':'третье',
    '04':'четвоертое',
    '05':'пятое',
    '06':'шестое',
    '07':'седьмое',
    '08':'восьмое',
    '09':'девятое',
    '10':'десятое',
    '11':'одинадцатое',
    '12':'двенадцатое',
    '13':'тринадцатое',
    '14':'четырнадцатое',
    '15':'пятнадцатое',
    '16':'шестнадцатое',
    '17':'семнадцатое',
    '18':'восемнадцатое',
    '19':'девятнадцатое',
    '20':'двадцатое',
    '21':'двадцать первое',
    '22': 'двадцать второе',
    '23': 'двадцать третье',
    '24': 'двадцать четвертое',
    '25': 'двадцать пятое',
    '26': 'двадцать шестое',
    '27': 'двадцать седбмое',
    '28': 'двадцать восьмое',
    '29': 'двадцать девятое',
    '30': 'тридцатое',
    '31': 'тридцать первое'
}

months = {
    '01':'января',
    '02':'февраля',
    '03':'марта',
    '04':'апреля',
    '05':'мая',
    '06':'июня',
    '07':'июля',
    '08':'августа',
    '09':'сентября',
    '10':'октября',
    '11':'ноября',
    '12':'декабря'
}

day = (days[key_day])
month = (months[key_month])
print('Вы ввели дату: ', data, 'это значит:', day.upper(), month.upper(), year, 'года')